In [7]:
import pandas as pd

# Descriptive Statistics Challenges
<hr style="border:2px solid black">

### Solve the following with `pandas` challenges:

**1. read the life expectancy cleaned dataset**

In [8]:
life_df = pd.read_csv('../data/expectancy_after_1950.csv', index_col=0)
life_df.head()

                   country  year  life expectancy
39001          Afghanistan  1950            26.85
39003              Albania  1950            54.48
39004              Algeria  1950            42.77
39007               Angola  1950            30.70
39009  Antigua and Barbuda  1950            57.97

**2. calculate the mean life expectancy**

In [11]:
mean_life_all = round(life_df['life expectancy'].mean(),2)
mean_life_all

62.99

**3. calculate the mean life expectancy for the year 2000**

In [16]:
life_2000 = life_df[life_df['year'] == 2000]
mean_life_2000 = round(life_2000['life expectancy'].mean(),2)
mean_life_2000

68.08

**4. calculate the median for 1995**

In [19]:
life_1995 = life_df[life_df['year'] == 1995]
life_1995 = life_1995.sort_values(by='life expectancy', ascending=True)
life_1995

                        country  year  life expectancy
50886                    Rwanda  1995            43.80
50734                   Burundi  1995            44.50
50740  Central African Republic  1995            46.70
50956                    Zambia  1995            46.90
50834                    Malawi  1995            46.90
...                         ...   ...              ...
50798          Hong Kong, China  1995            78.72
50918                    Sweden  1995            78.90
50800                   Iceland  1995            78.90
50810                     Japan  1995            79.70
50706                   Andorra  1995            82.60

[208 rows x 3 columns]

In [21]:
median_life_1995 = life_1995['life expectancy'].median()
median_life_1995

70.0

**5. calculate the standard deviation**

In [23]:
std_life_all = life_df['life expectancy'].std()
std_life_all

11.89557179977114

**6. find the highest life expectancy**

In [26]:
max_life_all = life_df['life expectancy'].max()
max_life_all

84.8

**7. find the country and year for the highest life expectancy**

In [27]:
life_df[life_df['life expectancy']==84.8]

       country  year  life expectancy
55386  Andorra  2013             84.8
55646  Andorra  2014             84.8
55906  Andorra  2015             84.8
56166  Andorra  2016             84.8

**8. find the lowest life expectancy**

In [29]:
min_life_all = life_df['life expectancy'].min()
min_life_all

13.2

**9. find the country and year was the lowest life expectancy**

In [30]:
life_df[life_df['life expectancy']==13.2]

      country  year  life expectancy
50626  Rwanda  1994             13.2

**10. find the 90% quantile of the life expectancy**

In [32]:
q90_life_all = life_df['life expectancy'].quantile(0.9)
q90_life_all

76.4

**11. calculate min, max, mean and possibly other descriptors with a single line**

In [33]:
life_df.describe()

               year  life expectancy
count  13707.000000     13707.000000
mean    1983.251550        62.988833
std       19.364466        11.895572
min     1950.000000        13.200000
25%     1966.000000        54.815000
50%     1983.000000        65.570000
75%     2000.000000        72.230000
max     2016.000000        84.800000

## SUMMARY

In [48]:
print(f'mean life expectancy = {mean_life_all}\n'
      f'mean life expectancy for the year 2000 = {mean_life_2000}\n'
      f'median for 1995 = {median_life_1995}\n'
      f'standard deviation = {std_life_all}\n'
      f'highest life expectancy = {max_life_all}\n'
      f'...Country and year = Andorra, 2013-16\nlowest life expectancy = {min_life_all}\n'
      f'... Country and year = Rwanda, 1994\nthe 90% quantile = {q90_life_all}\n'
      "the min, max, mean and possibly other descriptors with a single line = , 'life_df.describe()")

mean life expectancy = 62.99
mean life expectancy for the year 2000 = 68.08
median for 1995 = 70.0
standard deviation = 11.89557179977114
highest life expectancy = 84.8
...Country and year = Andorra, 2013-16
lowest life expectancy = 13.2
... Country and year = Rwanda, 1994
the 90% quantile = 76.4
the min, max, mean and possibly other descriptors with a single line = , 'life_df.describe()